```
 terraform apply
data.google_project.selected: Refreshing state...

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_service_account.lacework[0] will be created
  + resource "google_service_account" "lacework" {
      + account_id   = (known after apply)
      + display_name = (known after apply)
      + email        = (known after apply)
      + id           = (known after apply)
      + name         = (known after apply)
      + project      = "lacework-ecosystem2"
      + unique_id    = (known after apply)
    }

  # google_service_account_key.lacework[0] will be created
  + resource "google_service_account_key" "lacework" {
      + id                 = (known after apply)
      + key_algorithm      = "KEY_ALG_RSA_2048"
      + name               = (known after apply)
      + private_key        = (sensitive value)
      + private_key_type   = "TYPE_GOOGLE_CREDENTIALS_FILE"
      + public_key         = (known after apply)
      + public_key_type    = "TYPE_X509_PEM_FILE"
      + service_account_id = (known after apply)
      + valid_after        = (known after apply)
      + valid_before       = (known after apply)
    }

  # random_id.uniq will be created
  + resource "random_id" "uniq" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 4
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

random_id.uniq: Creating...
random_id.uniq: Creation complete after 0s [id=gHDZKQ]
google_service_account.lacework[0]: Creating...
google_service_account.lacework[0]: Creation complete after 3s [id=projects/lacework-ecosystem2/serviceAccounts/lwsvc-8070d929@lacework-ecosystem2.iam.gserviceaccount.com]
google_service_account_key.lacework[0]: Creating...
google_service_account_key.lacework[0]: Creation complete after 2s [id=projects/lacework-ecosystem2/serviceAccounts/lwsvc-8070d929@lacework-ecosystem2.iam.gserviceaccount.com/keys/dc499ee8eac1ee9b6704095f159f243ce0bb75c5]

Apply complete! Resources: 3 added, 0 changed, 0 destroyed.

Outputs:

created = true
name =
private_key = ......
project_id = lacework-ecosystem2
```